RT-Thread/rt-thread/bsp/at32/libraries/AT32F45x_Firmware_Library/drivers/src/at32f45x_usb.c
/**
  **************************************************************************
  * @file     at32f45x_usb.c
  * @brief    contains all the functions for the usb firmware library
  **************************************************************************
  *                       Copyright notice & Disclaimer
  *
  * The software Board Support Package (BSP) that is made available to
  * download from Artery official website is the copyrighted work of Artery.
  * Artery authorizes customers to use, copy, and distribute the BSP
  * software and its related documentation for the purpose of design and
  * development in conjunction with Artery microcontrollers. Use of the
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */

#include "at32f45x_conf.h"

/** @addtogroup AT32F45x_periph_driver
  * @{
  */

/** @defgroup USB
  * @brief USB driver modules
  * @{
  */

#ifdef USB_MODULE_ENABLED

/** @defgroup USB_private_functions
  * @{
  */

#ifdef OTGFS_USB_GLOBAL
/**
  * @brief  usb global core soft reset
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @retval error status
  */
error_status usb_global_reset(otg_global_type *usbx)
{
  uint32_t timeout = 0;
  while(usbx->grstctl_bit.ahbidle == RESET)
  {
    if(timeout ++ > 200000)
    {
      break;
    }
  }
  timeout = 0;
  usbx->grstctl_bit.csftrst = TRUE;
  while(usbx->grstctl_bit.csftrst == SET)
  {
    if(timeout ++ > 200000)
    {
      break;
    }
  }
  return SUCCESS;
}

/**
  * @brief  usb global initialization
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @retval none
  */
void usb_global_init(otg_global_type *usbx)
{
  /* reset otg moudle */
  usb_global_reset(usbx);

  /* exit power down mode */
  usbx->gccfg_bit.pwrdown = TRUE;
}

/**
  * @brief  usb global select usb core (otg1 or otg2).
  * @param  usb_id: select otg1 or otg2
  *         this parameter can be one of the following values:
  *         - USB_OTG1_ID
  * @retval usb global register type pointer
  */
otg_global_type *usb_global_select_core(uint8_t usb_id)
{
  UNUSED(usb_id);
  return OTG1_GLOBAL;
}

/**
  * @brief  flush tx fifo
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @param  fifo_num: tx fifo num,when fifo_num=16,flush all tx fifo
  *         parameter as following values: 0-16
  * @retval none
  */
void usb_flush_tx_fifo(otg_global_type *usbx, uint32_t fifo_num)
{
  uint32_t timeout = 0;
  /* set flush fifo number */
  usbx->grstctl_bit.txfnum = fifo_num;

  /* start flush fifo */
  usbx->grstctl_bit.txfflsh = TRUE;

  while(usbx->grstctl_bit.txfflsh == TRUE)
  {
    if(timeout ++ > 200000)
    {
      break;
    }
  }
}

/**
  * @brief  flush rx fifo
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @retval none
  */
void usb_flush_rx_fifo(otg_global_type *usbx)
{
  uint32_t timeout = 0;
  usbx->grstctl_bit.rxfflsh = TRUE;
  while(usbx->grstctl_bit.rxfflsh == TRUE)
  {
    if(timeout ++ > 200000)
    {
      break;
    }
  }
}

/**
  * @brief  usb interrupt mask enable
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @param  interrupt:
  *         this parameter can be any combination of the following values:
  *         - USB_OTG_MODEMIS_INT
  *         - USB_OTG_OTGINT_INT
  *         - USB_OTG_SOF_INT
  *         - USB_OTG_RXFLVL_INT
  *         - USB_OTG_NPTXFEMP_INT
  *         - USB_OTG_GINNAKEFF_INT
  *         - USB_OTG_GOUTNAKEFF_INT
  *         - USB_OTG_ERLYSUSP_INT
  *         - USB_OTG_USBSUSP_INT
  *         - USB_OTG_USBRST_INT
  *         - USB_OTG_ENUMDONE_INT
  *         - USB_OTG_ISOOUTDROP_INT
  *         - USB_OTG_IEPT_INT
  *         - USB_OTG_OEPT_INT
  *         - USB_OTG_INCOMISOIN_INT
  *         - USB_OTG_INCOMPIP_INCOMPISOOUT_INT
  *         - USB_OTG_PRT_INT
  *         - USB_OTG_HCH_INT
  *         - USB_OTG_PTXFEMP_INT
  *         - USB_OTG_CONIDSCHG_INT
  *         - USB_OTG_DISCON_INT
  *         - USB_OTG_WKUP_INT
  * @param  new_state: TRUE or FALSE
  * @retval none
  */
void usb_global_interrupt_enable(otg_global_type *usbx, uint16_t interrupt, confirm_state new_state)
{
  if(new_state == TRUE)
  {
     usbx->gintmsk |= interrupt;
  }
  else
  {
     usbx->gintmsk &= ~interrupt;
  }
}

/**
  * @brief  get all global core interrupt flag
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @retval intterupt flag
  */
uint32_t usb_global_get_all_interrupt(otg_global_type *usbx)
{
  uint32_t intsts = usbx->gintsts;
  return intsts & usbx->gintmsk;
}

/**
  * @brief  clear the global interrupt flag
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  *         - OTG2_GLOBAL
  * @param  flag: interrupt flag
  *         this parameter can be any combination of the following values:
  *         - USB_OTG_MODEMIS_FLAG
  *         - USB_OTG_OTGINT_FLAG
  *         - USB_OTG_SOF_FLAG
  *         - USB_OTG_RXFLVL_FLAG
  *         - USB_OTG_NPTXFEMP_FLAG
  *         - USB_OTG_GINNAKEFF_FLAG
  *         - USB_OTG_GOUTNAKEFF_FLAG
  *         - USB_OTG_ERLYSUSP_FLAG
  *         - USB_OTG_USBSUSP_FLAG
  *         - USB_OTG_USBRST_FLAG
  *         - USB_OTG_ENUMDONE_FLAG
  *         - USB_OTG_ISOOUTDROP_FLAG
  *         - USB_OTG_EOPF_FLAG
  *         - USB_OTG_IEPT_FLAG
  *         - USB_OTG_OEPT_FLAG
  *         - USB_OTG_INCOMISOIN_FLAG
  *         - USB_OTG_INCOMPIP_INCOMPISOOUT_FLAG
  *         - USB_OTG_PRT_FLAG
  *         - USB_OTG_HCH_FLAG
  *         - USB_OTG_PTXFEMP_FLAG
  *         - USB_OTG_CONIDSCHG_FLAG
  *         - USB_OTG_DISCON_FLAG
  *         - USB_OTG_WKUP_FLAG
  * @retval none
  */
void usb_global_clear_interrupt(otg_global_type *usbx, uint32_t flag)
{
  usbx->gintsts = flag;
}

/**
  * @brief  usb global interrupt enable
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         OTG1_GLOBAL
  * @retval none
  */
void usb_interrupt_enable(otg_global_type *usbx)
{
  usbx->gahbcfg_bit.glbintmsk = TRUE;
}

/**
  * @brief  usb global interrupt disable
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @retval none
  */
void usb_interrupt_disable(otg_global_type *usbx)
{
  usbx->gahbcfg_bit.glbintmsk = FALSE;
}

/**
  * @brief  usb set rx fifo size
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @param  size: rx fifo size
  * @retval none
  */
void usb_set_rx_fifo(otg_global_type *usbx, uint16_t size)
{
  usbx->grxfsiz = size;
}

/**
  * @brief  usb set tx fifo size
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @param  txfifo: the fifo number
  * @param  size: tx fifo size
  * @retval none
  */
void usb_set_tx_fifo(otg_global_type *usbx, uint8_t txfifo, uint16_t size)
{
  uint8_t i_index = 0;
  uint32_t offset = 0;

