RT-Thread/rt-thread/bsp/at32/libraries/AT32F45x_Firmware_Library/drivers/src/at32f45x_usb.c
  offset = usbx->grxfsiz;
  if(txfifo == 0)
  {
    usbx->gnptxfsiz_ept0tx = offset | (size << 16);
  }
  else
  {
    offset += usbx->gnptxfsiz_ept0tx_bit.nptxfdep;
    for(i_index = 0; i_index < (txfifo - 1); i_index ++)
    {
      offset += usbx->dieptxfn_bit[i_index].ineptxfdep;
    }
    usbx->dieptxfn[txfifo - 1] = offset | (size << 16);
  }
}


/**
  * @brief  set otg mode(device or host mode)
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @param  mode:
            this parameter can be one of the following values:
  *         - OTG_DEVICE_MODE
  *         - OTG_HOST_MODE
  *         - OTG_DRD_MODE
  * @retval none
  */
void usb_global_set_mode(otg_global_type *usbx, uint32_t mode)
{
  /* set otg to device mode */
  if(mode == OTG_DEVICE_MODE)
  {
    usbx->gusbcfg_bit.fhstmode = FALSE;
    usbx->gusbcfg_bit.fdevmode = TRUE;
  }

  /* set otg to host mode */
  if(mode == OTG_HOST_MODE)
  {
    usbx->gusbcfg_bit.fdevmode = FALSE;
    usbx->gusbcfg_bit.fhstmode = TRUE;
  }

  /* set otg to default mode */
  if(mode == OTG_DRD_MODE)
  {
    usbx->gusbcfg_bit.fdevmode = FALSE;
    usbx->gusbcfg_bit.fhstmode = FALSE;
  }
}


/**
  * @brief  disable the transceiver power down mode
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @retval none
  */
void usb_global_power_on(otg_global_type *usbx)
{
  /* core soft reset */
  usbx->grstctl_bit.csftrst = TRUE;
  while(usbx->grstctl_bit.csftrst);

  /* disable power down mode */
  usbx->gccfg_bit.pwrdown = TRUE;

}

/**
  * @brief  usb stop phy clock
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @retval none
  */
void usb_stop_phy_clk(otg_global_type *usbx)
{
  OTG_PCGCCTL(usbx)->pcgcctl_bit.stoppclk = TRUE;
}

/**
  * @brief  usb open phy clock
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @retval none
  */
void usb_open_phy_clk(otg_global_type *usbx)
{
  OTG_PCGCCTL(usbx)->pcgcctl_bit.stoppclk = FALSE;
}


/**
  * @brief  write data from user memory to usb buffer
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @param  pusr_buf: point to user buffer
  * @param  offset_addr: endpoint tx offset address
  * @param  nbytes: number of bytes data write to usb buffer
  * @retval none
  */
void usb_write_packet(otg_global_type *usbx, uint8_t *pusr_buf, uint16_t num, uint16_t nbytes)
{
  uint32_t n_index;
  uint32_t nhbytes = (nbytes + 3) / 4;
  uint32_t *pbuf = (uint32_t *)pusr_buf;
  for(n_index = 0; n_index < nhbytes; n_index ++)
  {
#if defined (__ICCARM__) && (__VER__ < 7000000)
    USB_FIFO(usbx, num) = *(__packed uint32_t *)pbuf;
#else
    USB_FIFO(usbx, num) = __UNALIGNED_UINT32_READ(pbuf);
#endif
    pbuf ++;
  }
}

/**
  * @brief  read data from usb buffer to user buffer
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @param  pusr_buf: point to user buffer
  * @param  offset_addr: endpoint rx offset address
  * @param  nbytes: number of bytes data write to usb buffer
  * @retval none
  */
void usb_read_packet(otg_global_type *usbx, uint8_t *pusr_buf, uint16_t num, uint16_t nbytes)
{
  uint32_t n_index;
  uint32_t nhbytes = (nbytes + 3) / 4;
  uint32_t *pbuf = (uint32_t *)pusr_buf;
  UNUSED(num);
  for(n_index = 0; n_index < nhbytes; n_index ++)
  {
#if defined (__ICCARM__) && (__VER__ < 7000000)
    *(__packed uint32_t *)pbuf = USB_FIFO(usbx, 0);
#else
    __UNALIGNED_UINT32_WRITE(pbuf, (USB_FIFO(usbx, 0)));
#endif
    pbuf ++;
  }
}
#endif


#ifdef OTGFS_USB_DEVICE
/**
  * @brief  open usb endpoint
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @param  ept_info: endpoint information structure
  * @retval none
  */
void usb_ept_open(otg_global_type *usbx, usb_ept_info *ept_info)
{
  uint8_t mps = USB_EPT0_MPS_64;
  if(ept_info->eptn == USB_EPT0)
  {
    if(ept_info->maxpacket == 0x40)
    {
      mps = USB_EPT0_MPS_64;
    }
    else if(ept_info->maxpacket == 0x20)
    {
      mps = USB_EPT0_MPS_32;
    }
    else if(ept_info->maxpacket == 0x10)
    {
      mps = USB_EPT0_MPS_16;
    }
    else if(ept_info->maxpacket == 0x08)
    {
      mps = USB_EPT0_MPS_8;
    }
  }
  if(ept_info->trans_type == EPT_ISO_TYPE)
  {
    OTG_DEVICE(usbx)->dctl |= 1 << 15;
  }
  /* endpoint direction is in */
  if(ept_info->inout == EPT_DIR_IN)
  {
    OTG_DEVICE(usbx)->daintmsk |= 1 << ept_info->eptn;
    if(ept_info->eptn == USB_EPT0)
    {
      USB_INEPT(usbx, ept_info->eptn)->diepctl_bit.mps = mps;
    }
    else
    {
      USB_INEPT(usbx, ept_info->eptn)->diepctl_bit.mps = ept_info->maxpacket;
    }
    USB_INEPT(usbx, ept_info->eptn)->diepctl_bit.eptype = ept_info->trans_type;
    USB_INEPT(usbx, ept_info->eptn)->diepctl_bit.txfnum = ept_info->eptn;
    USB_INEPT(usbx, ept_info->eptn)->diepctl_bit.setd0pid = TRUE;
    USB_INEPT(usbx, ept_info->eptn)->diepctl_bit.usbacept = TRUE;
  }
  /* endpoint direction is out */
  else
  {
    OTG_DEVICE(usbx)->daintmsk |= (1 << ept_info->eptn) << 16;
    if(ept_info->eptn == USB_EPT0)
    {
      USB_OUTEPT(usbx, ept_info->eptn)->doepctl_bit.mps = mps;
    }
    else
    {
      USB_OUTEPT(usbx, ept_info->eptn)->doepctl_bit.mps = ept_info->maxpacket;
    }
    USB_OUTEPT(usbx, ept_info->eptn)->doepctl_bit.eptype = ept_info->trans_type;
    USB_OUTEPT(usbx, ept_info->eptn)->doepctl_bit.setd0pid = TRUE;
    USB_OUTEPT(usbx, ept_info->eptn)->doepctl_bit.usbacept = TRUE;
  }
}

/**
  * @brief  close usb endpoint
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @param  ept_info: endpoint information structure
  * @retval none
  */
void usb_ept_close(otg_global_type *usbx, usb_ept_info *ept_info)
{
  if(ept_info->inout == EPT_DIR_IN)
  {
    OTG_DEVICE(usbx)->daintmsk &= ~(1 << ept_info->eptn);
    if(USB_INEPT(usbx, ept_info->eptn)->diepctl_bit.eptena == SET)
    {
      USB_INEPT(usbx, ept_info->eptn)->diepctl_bit.eptdis = TRUE;
      USB_INEPT(usbx, ept_info->eptn)->diepctl_bit.snak = TRUE;
    }
    USB_INEPT(usbx, ept_info->eptn)->diepctl_bit.usbacept = FALSE;
  }
  else
  {
    OTG_DEVICE(usbx)->daintmsk &= ~((1 << ept_info->eptn) << 16);
    if(USB_OUTEPT(usbx, ept_info->eptn)->doepctl_bit.eptena == SET)
    {
      USB_OUTEPT(usbx, ept_info->eptn)->doepctl_bit.eptdis = TRUE;
      USB_OUTEPT(usbx, ept_info->eptn)->doepctl_bit.snak = TRUE;
    }

    USB_OUTEPT(usbx, ept_info->eptn)->doepctl_bit.usbacept = FALSE;
  }
}


/**
  * @brief  set endpoint tx or rx status to stall
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @param  ept_info: endpoint information structure
  * @retval none
  */
void usb_ept_stall(otg_global_type *usbx, usb_ept_info *ept_info)
{
  if(ept_info->inout == EPT_DIR_IN)
  {
    if(USB_INEPT(usbx, ept_info->eptn)->diepctl_bit.eptena == RESET)
    {
      USB_INEPT(usbx, ept_info->eptn)->diepctl_bit.eptdis = FALSE;
    }
    USB_INEPT(usbx, ept_info->eptn)->diepctl_bit.stall = SET;
  }
  else
  {
    if(USB_OUTEPT(usbx, ept_info->eptn)->doepctl_bit.eptena == RESET)
    {
      USB_OUTEPT(usbx, ept_info->eptn)->doepctl_bit.eptdis = FALSE;
    }
    USB_OUTEPT(usbx, ept_info->eptn)->doepctl_bit.stall = TRUE;
  }
}

/**
  * @brief  clear endpoint tx or rx status to stall
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @param  ept_info: endpoint information structure
  * @retval none
  */
void usb_ept_clear_stall(otg_global_type *usbx, usb_ept_info *ept_info)
{
  if(ept_info->inout == EPT_DIR_IN)
  {
    USB_INEPT(usbx, ept_info->eptn)->diepctl_bit.stall = FALSE;
    if(ept_info->trans_type == EPT_INT_TYPE || ept_info->trans_type == EPT_BULK_TYPE)
    {
      USB_INEPT(usbx, ept_info->eptn)->diepctl_bit.setd0pid = TRUE;
    }
  }
  else
  {
    USB_OUTEPT(usbx, ept_info->eptn)->doepctl_bit.stall = FALSE;
    if(ept_info->trans_type == EPT_INT_TYPE || ept_info->trans_type == EPT_BULK_TYPE)
    {
      USB_OUTEPT(usbx, ept_info->eptn)->doepctl_bit.setd0pid = TRUE;
    }
  }
}

/**
  * @brief  get all out endpoint interrupt bits
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @retval out endpoint interrupt bits
  */
uint32_t usb_get_all_out_interrupt(otg_global_type *usbx)
{
  uint32_t intsts = OTG_DEVICE(usbx)->daint;
  return ((intsts & (OTG_DEVICE(usbx)->daintmsk)) >> 16);
}

/**
  * @brief  get all in endpoint interrupt bits
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @retval in endpoint interrupt bits
  */
uint32_t usb_get_all_in_interrupt(otg_global_type *usbx)
{
  uint32_t intsts = OTG_DEVICE(usbx)->daint;
  return ((intsts & (OTG_DEVICE(usbx)->daintmsk)) & 0xFFFF);
}


/**
  * @brief  get out endpoint interrupt flag
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @param  eptn: endpoint number
  * @retval out endpoint interrupt flags
  */
uint32_t usb_ept_out_interrupt(otg_global_type *usbx, uint32_t eptn)
{
  uint32_t intsts = USB_OUTEPT(usbx, eptn)->doepint;
  return (intsts & (OTG_DEVICE(usbx)->doepmsk));
}

/**
  * @brief  get in endpoint interrupt flag
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @param  eptn: endpoint number
  * @retval in endpoint intterupt flags
  */
uint32_t usb_ept_in_interrupt(otg_global_type *usbx, uint32_t eptn)
{
  uint32_t intsts, mask1, mask2;
  mask1 = OTG_DEVICE(usbx)->diepmsk;
  mask2 = OTG_DEVICE(usbx)->diepempmsk;
  mask1 |= ((mask2 >> eptn) & 0x1) << 7;
  intsts = USB_INEPT(usbx, eptn)->diepint & mask1;
  return intsts;
}

/**
  * @brief  clear out endpoint interrupt flag
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @param  eptn: endpoint number
  * @retval flag: interrupt flag
  *         this parameter can be any combination of the following values:
  *         - USB_OTG_DOEPINT_XFERC_FLAG
  *         - USB_OTG_DOEPINT_EPTDISD_FLAG
  *         - USB_OTG_DOEPINT_SETUP_FLAG
  *         - USB_OTG_DOEPINT_OTEPDIS_FLAG
  *         - USB_OTG_DOEPINT_B2BSTUP_FLAG
  */
void usb_ept_out_clear(otg_global_type *usbx, uint32_t eptn, uint32_t flag)
{
  USB_OUTEPT(usbx, eptn)->doepint = flag;
}

/**
  * @brief  clear in endpoint interrupt flag
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @param  eptn: endpoint number
  * @retval flag: interrupt flag
  *         this parameter can be any combination of the following values:
  *         - USB_OTG_DIEPINT_XFERC_FLAG
  *         - USB_OTG_DIEPINT_EPTDISD_FLAG
  *         - USB_OTG_DIEPINT_TMROC_FLAG
  *         - USB_OTG_DIEPINT_INTTXFE_FLAG
  *         - USB_OTG_DIEPINT_INEPNE_FLAG
  *         - USB_OTG_DIEPINT_TXFE_FLAG
  */
void usb_ept_in_clear(otg_global_type *usbx, uint32_t eptn, uint32_t flag)
{
  USB_INEPT(usbx, eptn)->diepint = flag;
}


/**
  * @brief  set the host assignment address
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @param  address: host assignment address
  * @retval none
  */
void usb_set_address(otg_global_type *usbx, uint8_t address)
{
  OTG_DEVICE(usbx)->dcfg_bit.devaddr = address;
}

/**
  * @brief  enable endpoint 0 out
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @retval none
  */
void usb_ept0_start(otg_global_type *usbx)
{
  otg_eptout_type *usb_outept = USB_OUTEPT(usbx, 0);
  usb_outept->doeptsiz = 0;
  usb_outept->doeptsiz_bit.pktcnt = 1;
  usb_outept->doeptsiz_bit.xfersize = 24;
  usb_outept->doeptsiz_bit.rxdpid_setupcnt = 3;
}


/**
  * @brief  endpoint 0 start setup
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @retval none
  */
void usb_ept0_setup(otg_global_type *usbx)
{
  USB_INEPT(usbx, 0)->diepctl_bit.mps = 0;
  OTG_DEVICE(usbx)->dctl_bit.cgnpinak = FALSE;
}

/**
  * @brief  connect usb device by enable pull-up
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @retval none
  */
void usb_connect(otg_global_type *usbx)
{
  /* D+ 1.5k pull-up enable */
  OTG_DEVICE(usbx)->dctl_bit.sftdiscon = FALSE;
}

/**
  * @brief  disconnect usb device by disable pull-up
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @retval none
  */
void usb_disconnect(otg_global_type *usbx)
{
  /* D+ 1.5k pull-up disable */
  OTG_DEVICE(usbx)->dctl_bit.sftdiscon = TRUE;
}


/**
  * @brief  usb remote wakeup set
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @retval none
  */
void usb_remote_wkup_set(otg_global_type *usbx)
{
  OTG_DEVICE(usbx)->dctl_bit.rwkupsig = TRUE;
}

/**
  * @brief  usb remote wakeup clear
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @retval none
  */
void usb_remote_wkup_clear(otg_global_type *usbx)
{
  OTG_DEVICE(usbx)->dctl_bit.rwkupsig = FALSE;
}

/**
  * @brief  usb suspend status get
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  * @retval usb suspend status
  */
uint8_t usb_suspend_status_get(otg_global_type *usbx)
{
  return OTG_DEVICE(usbx)->dsts_bit.suspsts;
}
#endif

